{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"inputs": {"title:0": {"name": "title:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown_2:0": {"name": "unknown_2:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1229}, "user_id:0": {"name": "user_id:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1238}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "401"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/embedding_2/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "300"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/embedding_3/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "title", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "unknown_2", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "user_id", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/string_lookup_3/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_2", "title", "unknown_3"], "attr": {"Tout": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/string_lookup_2/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "user_id", "unknown_0"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tout": {"type": "DT_INT64"}, "Tin": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/embedding_3/embedding_lookup", "op": "GatherV2", "input": ["unknown_4", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/string_lookup_3/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/embedding_3/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/embedding_2/embedding_lookup", "op": "GatherV2", "input": ["unknown_1", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/string_lookup_2/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/embedding_2/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/embedding_2/embedding_lookup", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/embedding_3/embedding_lookup", "StatefulPartitionedCall/book_model/ranking_model_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/book_model/ranking_model_1/concat", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/Relu", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/Relu", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "1807", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "1809", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "1813", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "299"}]}}}}}, {"name": "1815", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "299"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_18", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_18"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "Mjc2X2xvYWRfMV8zNDg="}, "container": {"s": ""}, "value_dtype": {"type": "DT_INT64"}, "key_dtype": {"type": "DT_STRING"}, "use_node_name_sharing": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/hash_table"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_19", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_20", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_20"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_19", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_21", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_22", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_21"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["1807", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_23", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_21"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_6", "op": "Identity", "input": ["1809", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_24", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_6", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_21"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/key_value_init275/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_22", "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_23", "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_24"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_26", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/key_value_init275/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_26"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/input_control_node/_9", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_27", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/input_control_node/_9"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_27"], "attr": {"key_dtype": {"type": "DT_STRING"}, "use_node_name_sharing": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "container": {"s": ""}, "value_dtype": {"type": "DT_INT64"}, "shared_name": {"s": "Mjk5X2xvYWRfMV80ODI="}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_29", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/output_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_28", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall_2/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall_2/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_28", "^StatefulPartitionedCall_2/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/output/_10", "op": "Identity", "input": ["StatefulPartitionedCall_2/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/input_control_node/_12", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/output/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_10", "^Func/StatefulPartitionedCall_3/input_control_node/_12"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_30", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/input_control_node/_12"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_31", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_13", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_30"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_14", "op": "Identity", "input": ["1813", "^Func/StatefulPartitionedCall_3/input_control_node/_12"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_32", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_14", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_30"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_15", "op": "Identity", "input": ["1815", "^Func/StatefulPartitionedCall_3/input_control_node/_12"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_33", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_15", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_30"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall_3/StatefulPartitionedCall/key_value_init298/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_31", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_32", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tout": {"type": "DT_INT64"}, "Tin": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_35", "op": "NoOp", "input": ["^StatefulPartitionedCall_3/StatefulPartitionedCall/key_value_init298/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/output_control_node/_17", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_8", "^Func/StatefulPartitionedCall_2/output_control_node/_11", "^Func/StatefulPartitionedCall_3/output_control_node/_17"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_8", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_10", "^Func/StatefulPartitionedCall_3/output_control_node/_17", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1395}}, "initializerSignature": {"outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1229}, "Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1238}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_1", "shape": [401, 32], "dtype": "float32"}, {"name": "unknown_0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_3/embedding_2/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_4", "shape": [300, 32], "dtype": "float32"}, {"name": "unknown_3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_4/embedding_3/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/MatMul/ReadVariableOp", "shape": [64, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/MatMul/ReadVariableOp", "shape": [256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_4/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/MatMul/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/book_model/ranking_model_1/sequential_5/dense_5/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "1807", "shape": [400], "dtype": "string"}, {"name": "1809", "shape": [400], "dtype": "int32"}, {"name": "1813", "shape": [299], "dtype": "string"}, {"name": "1815", "shape": [299], "dtype": "int32"}]}]}